//============================================================================
//文件名称：cmp.h
//功能概要：KL25 比较器底层驱动程序头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//版本更新：2012-11-25  V1.0   初始版本
//============================================================================

#ifndef HSCMP_H
#define HSCMP_H

	//1 头文件
	#include "common.h"

	//2 宏定义
	//2.1比较模块号宏定义
	#define cmpch0 CMP0_BASE_PTR

	//2.2 比较模块中断号处理
	#define CMP0irq 16


	//3函数声明

	//============================================================================
	//函数名称：hw_cmp_init
	//函数返回     无
	//参数说明;reference:参考电压选择  0=VDDA 3.3V 1=VREF 1.2V
	//         plusChannel: 正比较通道号
	//         minusChannel：负比较通道号
	//功能概要：CMP模块初始化
	//============================================================================
	void cmp_init(uint8_t reference,uint8_t plusChannel,uint8_t minusChannel);
	//============================================================================
	//函数名称：hw_dac_set_value
	//函数返回：无
	//参数说明：value: dac输出的转换值
	//功能概要：开比较中断。
	//============================================================================
	void cmp_dac_set_value(uint8_t value);
	//============================================================================
	//函数名称：hw_enable_cmp_int
	//函数返回：无
	//参数说明：无
	//功能概要：开比较中断。
	//============================================================================
	void enable_cmp_int();

	//============================================================================
	//函数名称：hw_disable_cmp_int
	//函数返回：无
	//参数说明：无
	//功能概要：关比较中断
	//============================================================================
	void disable_cmp_int();

#endif  //__ISR_H

