//==========================================================================
//文件名称：RTC.c
//功能概要：KL25 RTC底层驱动程序源文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//版本更新：2013-3-23  V2.0  柏祥
//==========================================================================
#ifndef __rtc_H__
#define __rtc_H__

#include "common.h"

#define   RTC_alarm_irq_no    20
#define   RTC_second_irq_no    21

//===============================================================
//函数名称：hw_rtc_init
//函数参数：SecendTimes:定时器秒寄存器的初始值
//函数返回：无
//功能概要：RTC驱动初始化
//===============================================================
void rtc_init(uint_32 seconds, uint_32 alarm);

#endif /* __RTC_H__ */
