//===========================================================================
//文件名称：systick.h
//功能概要：systick定时器模块构件头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2013-01-29   V1.0
//===========================================================================

#ifndef __SYSTICK_H
#define __SYSTICK_H

#include "common.h"

extern uint32_t systicks;

//===========================================================================
//函数名称：hw_systick_init
//函数返回：无
//参数说明：core_clk_hz：内核时钟频率
//      ticks_per_sec：滴答频率，以Hz为单位。
//功能概要：初始化ARM Cortex-M处理器内核的SysTick模块作为系统滴答时钟。
//===========================================================================
void systick_init(uint32_t core_clk_hz, uint32_t ticks_per_sec);

//===========================================================================
//函数名称：SecAdd1
//函数返回：无
//参数说明：*p:计数变量的首地址 
//功能概要：以秒为最小单位递增时,分,秒缓冲区的值(00:00:00-23:59:59)
//===========================================================================
void SecAdd1(uint8_t *p);

//===========================================================================
//函数名称：systick_trim
//函数返回：无
//参数说明：flag: 0表示慢，1表示快
//       trim_sec：每一分钟的秒数之差      
//功能概要：校准systick,如果每分钟慢一秒，SYST_RVR就减少48M/100/6000=80
//                 如果每分钟快一秒，SYST_RVR就增加48M/100/6000=80
//===========================================================================
void systick_trim(uint32_t core_clk_hz,uint32_t ticks_per_sec, uint32_t flag, uint32_t trim_sec);

//===========================================================================
//函数名称：systick_isr
//函数返回：无
//参数说明：无
//功能概要：SysTick定时器中断服务例程，更新系统滴答计数变量值。
//===========================================================================
void systick_isr(void);

#endif
