//============================================================================
//文件名称：hw_tsi.h
//功能概要：K60 tsi底层驱动程序头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//版本更新：2012-11-25  V1.0   初始版本
//============================================================================

#ifndef __TSI_H__
#define __TSI_H__

    //1 头文件
    #include "common.h"
    #include "uart.h"
    
    //2 宏定义

    //启动TSI模块
    #define TSI_ENABLE  TSI0_GENCS |=  TSI_GENCS_TSIEN_MASK
    //关闭TSI模块
    #define TSI_DISABLE TSI0_GENCS &= ~TSI_GENCS_TSIEN_MASK
    
    //启动TSI中断触发模式，同时启动自动周期扫描  
    //TSI Vector is 42. IRQ# is 42-16=26
    #define hw_tsi_enable_interrupt do {\
                  TSI0_GENCS |= (TSI_GENCS_TSIIEN_MASK|TSI_GENCS_STM_MASK);\
                  enable_irq(26);\
            } while (0)
    //放弃TSI中断触发模式，同时放弃自动周期扫描
    #define hw_tsi_disable_interrupt do {\
                  TSI0_GENCS &= ~(TSI_GENCS_TSIIEN_MASK|TSI_GENCS_STM_MASK);\
            } while (0)

              
//TSI通道计数寄存器
#define TSI_CH_CNTR     (uint_16)((TSI0_DATA)&0x0000FFFF)
       



//3 函数声明
//============================================================================
//函数名称：hw_tsi_init                                                  
//功能概要：初始化TSI模块                                                  
//参数说明：chnlID:8位无符号数，                                          
//                 为1位的对应通道为启动TSI功能
//                 为0的对应通道为不启动TSI功能                                          
//函数返回： 无                                                               
//============================================================================
void hw_tsi_init(uint_8 chnlID);
    
//============================================================================
//函数名称：hw_tsi_get_value16                                                  
//功能概要：获取TSI通道的计数值                                                  
//参数说明：value 16位无数，保存通道计数值，                                                                                    
//函数返回： 为获取TSI通道的计数值                                                                
//============================================================================
uint_16 hw_tsi_get_value16();
    
//============================================================================
//函数名称：hw_tsi_set_threshold                                                  
//功能概要：设定指定通道的阈值                                                  
//参数说明     low:   设定阈值下限                                              
//          high:  设定阈值上限                                                                                      
//函数返回： 无                                                             
//============================================================================
void hw_tsi_set_threshold(uint_16 low, uint_16 high);


//=========================================================================
//函数名称：tsi_enable
//参数说明：无
//函数返回：无
//功能概要：开TSI中断
//=========================================================================
void tsi_enable();


//=========================================================================
//函数名称：tsi_disable
//参数说明：无
//函数返回：无
//功能概要：关TSI中断
//=========================================================================
void tsi_disable();

//=========================================================================
//函数名称：tsi_softsearch
//参数说明：无
//函数返回：无
//功能概要：启动软件查询中断测试
//=========================================================================
void tsi_softsearch();


#endif 
